###1
print("Задание 1:")

print("Привет, мир!")
print(5, 10, 15)
print(10 + 25)


###2
print("Задание 2:")
print(1, 2, 3, sep = " & ")
print("Python", end =" ")
print("лучший язык")

###3
print("Задание 3:")
x = 3.14
y = -8
print(f"Координаты точки: x = {x}; y = {y}")

name = input("Введите имя: ")
age = float(input("Введите возраст: "))
#print(f"Имя: Иван, Возраст: 25") - в задании указано: "выведи: Имя: Иван, Возраст: 25  используя F-строку" :D
print(f"Имя: {name}, Возраст: {age}")

###4
print("Задание 4:")
name2 = input("Введите имя: ")
print(f"Привет, {name2}")

###5
print("Задание 5:")

a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
summ = (a + b)
print(f"Сумма чисел равна {summ}")

a1 = int(input("Введите целое число: "))
print(f"Квадрат введенного числа равен {a1 ** 2}")

